app/views/shared/_stats.html.erb

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---
      <td>
        <%= link_to @user.tweets.count, user_path(@user) %>